regtests/0274_doclit2/test.out

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
 xmlns:awsns="http://soapaws/"
 xmlns:abc="http://aurn.here.org/abc">
<abc:getQueueStatusRequest/>
</soapenv:Body>
</soapenv:Envelope>

numberQueued     = 1
maximumQueueSize = 16
<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
 xmlns:awsns="http://soapaws/"
 xmlns:abc="http://aurn.here.org/abc"
 xmlns:sp="http://aurn.here.org/spatial">
<abc:executeRequest>
   <abc:executionTime>XXXX-XX-XXTXX:XX:XXZ</abc:executionTime>
   <abc:valueA>
      <sp:latLong>
         <sp:latitudeDegrees>1.00000000000000E+00</sp:latitudeDegrees>
         <sp:longitudeDegrees>1.10000000000000E+00</sp:longitudeDegrees>
      </sp:latLong>
      <abc:field7>3.00000000000000E+00</abc:field7>
      <abc:field8>4.00000000000000E+00</abc:field8>
      <abc:field9>2</abc:field9>
      <abc:field12>9.00000000000000E-01</abc:field12>
      <abc:field10>8</abc:field10>
      <abc:field11>6.00000000000000E-01</abc:field11>
   </abc:valueA>
   <abc:valueA>
      <sp:latLong>
         <sp:latitudeDegrees>2.00000000000000E+00</sp:latitudeDegrees>
         <sp:longitudeDegrees>2.10000000000000E+00</sp:longitudeDegrees>
      </sp:latLong>
      <abc:field7>3.20000000000000E+00</abc:field7>
      <abc:field8>4.20000000000000E+00</abc:field8>
      <abc:field9>2</abc:field9>
      <abc:field12>9.10000000000000E-01</abc:field12>
      <abc:field10>81</abc:field10>
      <abc:field11>6.10000000000000E-01</abc:field11>
   </abc:valueA>

</abc:executeRequest>
</soapenv:Body>
</soapenv:Envelope>

invocationToken = this_is_the_token 1
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:abc="http://aurn.here.org/abc" xmlns:spat="http://aurn.here.org/spatial"><soapenv:Header/><soapenv:Body><abc:executeRequest><abc:executionTime>XXXX-XX-XXTXX:XX:XXZ</abc:executionTime><abc:valueA><abc:latLong><spat:latitudeDegrees>12.20000000000000</spat:latitudeDegrees><spat:longitudeDegrees>12.30000000000000</spat:longitudeDegrees></abc:latLong><abc:field7>100.00000000000000</abc:field7><abc:field8>100.00000000000000</abc:field8><abc:field9>100</abc:field9><abc:field12>1.00000000000000</abc:field12><abc:field10>1</abc:field10><abc:field11>1.00000000000000</abc:field11></abc:valueA></abc:executeRequest></soapenv:Body></soapenv:Envelope>
<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body
 xmlns:abc="http://aurn.here.org/abc">
<abc:executeResponse>
   <abc:invocationToken>this_is_the_token 2</abc:invocationToken>
</abc:executeResponse>
</soapenv:Body>
</soapenv:Envelope>
